[
    {
        "title": "Early Thoughts about Elixir",
        "body": "Some background: Most of my development experience is in Node & Ruby. And this is more of a post about the communities values more so than the languages themselves.<br /><br/> Ruby was probably the first programming language I really liked It was pleasant to use, productive and fun. But with rails every now and again I would run into a wall. The magic that some Rails library performed was extremely difficult to configure. I didn't find Ruby source code easy to navigate either -- granted I was a much greener dev back then. <br /> <br /> With Node I found it much easier to read the source. Granted there are so many different styles of JavaScript, and some older libraries can be really difficult to understand. But I loved that there was, generally speaking, very little magic. But I never found it all that productive. <br /> <br /> I had always been intrigued by Erlang and I knew I wanted to learn it but never knew where to start.<br /> <br /> Then came Elixir. A language that is very similiar but much more beginner friendly, and a web framework that curses magic! It was perfect. I was a little bit scared to commit to learning to a very functional programming language (although Erlangists will say it's the most OO language out there!) but I did it anyways -- for knowledge! <br /><br /> I decided to try writing a multiplayer game in Phoenix (<a href='https: //meaty-spiffy-hermitcrab.gigalixirapp.com'>Stabby Flies</a>) & the experience was phenomenal. Things just work! And everything is so easy to test. The language is pleasant to use and the conventions for documentation are really... nice! It's an excellent choice for browser game backends and I am excited to see what the future brings. There's still a lot I don't understand & I am still getting used to chopping things up into their own little processes but I really like what I've got so far. Elixir is fun to use, the community is nice, and their values align closely with mine. <br /> <br /> I write this a day after Joe Armstrong, the creator of Erlang, passed away. RIP Joe. Elixir & its community have been heavily influenced by his personality; his humility, appreciation for simplicity, and his ingenuity.  "
    }
]