[
    {
        "title": "First Impressions of Elixir",
        "body": "Some background: Most of my development experience is in Node & Ruby. And this is more of a post about the communities values more so than the languages themselves. I was recently hired to write Elixir & also used it for a side project.<br /><br/> Ruby was probably the first programming language I really liked. It felt like it was made for me. It was pleasant to use, productive and fun. But with rails every now and again I would run into a wall. The magic that some Rails library performed was extremely difficult to modify. I didn't find Ruby source code easy to navigate either -- granted I was a much greener dev back then. <br /> <br /> With Node I found it was much easier reading the source. Granted there are so many different styles of JavaScript, and some older libraries can be totally incomprehensible. But I loved that there was, generally speaking, very little magic. But I never found it all that productive. <br /> <br /> I had always been intrigued by Erlang and I knew I wanted to learn it but never knew where to start.<br /> <br /> Then came Elixir. A language that is very similiar but much more beginner friendly, and a web framework that curses magic! It was perfect. I was a little bit scared to commit to learning to a very functional programming language (although Erlangists will say it's most OO language out there!) but I did it anyways -- for knowledge! <br /><br /> So I decided to try writing a multiplayer game in Phoenix (Stabby Flies) & the experience has been phenomenal. Things just work & everything is so easy to test, the language is pleasant to use and the conventions for documentation are really... nice! I feel like it's an excellent choice for browser game backends and I am excited to see what the future brings. There's still a lot I don't understand & I am still getting used to chopping things up into their own little processes but I really like what I've got so far. Elixir is fun to use, the community is nice & their values align closely to mine. I feel like I have found a community that I can call my own. <br /> <br /> I write this a day after Joe Armstrong, the creator of Erlang, passed away. RIP Joe. I feel like Elixir & its community has been influenced by his personality; his humility, appreciation for simplicity, and his ingenuity.  "
    }
]